#pragma once

/**
 * @brief Глобальное пространство имен SwarmIDE.
 * Проект представляет собой высокопроизводительную C++ среду для визуального 
 * проектирования и оркестрации мультиагентных систем (нативный аналог n8n).
 */
namespace SwarmIDE {

    // =========================================================================
    // 1. КОГНИТИВНЫЙ И ПРЕДМЕТНЫЙ СЛОЙ (Business Logic & Entities)
    // =========================================================================
    namespace Object {

        class BaseObject;                  // Базовый класс для всех сущностей графа

        namespace AI {      
            class BaseAgent;               // Базовый абстрактный класс ИИ-агента
            class ConversationalAgent;     // Диалоговый агент (стандартная обработка контекста)
            class ToolsAgent;              // Агент, наделенный правом вызова внешних функций (Tools)
            class PlanExecuteAgent;        // Агент-оркестратор (декомпозиция сложных задач)
        }

        namespace Tool {
            class BaseTool;                // Абстракция внешнего инструмента (API, скрипты)
            class JiraSoftware;
        }

        namespace Memory {
            class BaseMemory;              // Абстракция хранилища (RAG, SQL, Векторные БД)
            class PostgreSQL;
        }
    }

    // =========================================================================
    // 2. СЛОЙ ВИЗУАЛИЗАЦИИ И UI (OpenGL 4.5 + Dear ImGui)
    // =========================================================================
    namespace UI {
        class Menu;                        // Панели управления, интерфейс создания объектов
        class Theme;                       // Глобальные стили (цвета, шрифты, параметры окон)
        class Topology;                    // Математика графа на экране (Якоря, Пины, Векторы)
        class ConnectionDrawer;            // Рендерер связей (отрисовка кривых Безье между нодами)

        // Семейство геометрических форм для визуального представления нод
        namespace Shape {
            class BaseShape;               // Базовая абстракция окна/фигуры
            class SquareShape;             // Квадратная форма
            class RectangleShape;          // Прямоугольная форма (стандарт для ИИ-агентов)
            class CircleShape;             // Круглая форма (используется для Models, Memory, Tools)
            class TriangleShape;           // Треугольная форма (логические ветвления/условия)
        }
    }   

    // =========================================================================
    // 3. ВЫЧИСЛИТЕЛЬНОЕ ЯДРО (C++ Core Dispatcher)
    // =========================================================================
    namespace Core {
        namespace Graph {
            class GraphManager;            // Управляет жизнью уже созданными объектами
            class DataVariant;             // Умный контейнер, который хранит различную информацию
            class GraphRegistry;           // Знает как создавать объекты
            class LogicNode;               // Умная логическая не визуальная нода
            class ModelNode;               // Нода, которая просто имеет id модели
            class LogicPin;                // Умный логический не визуальный пин
        }

        class AppController;               // Точка сборки приложения. Инициализация GLFW и Game Loop
        class ConnectionManager;           // Диспетчер связей (управляет логикой топологии графа)
        class TextureManager;              // Кэш-менеджер ресурсов (загрузка иконок в VRAM OpenGL)
        class SerializationManager;        // Менеджер сохранения и загрузки всего графа проекта (JSON)
        class ModelManager;                // Менеджер по загрузки моделей и управлению ими
        class GenerateIDManager;           // Менеджер по генерации уникальныйх id
    }


    // =========================================================================
    // 4. СЛОЙ ВНЕШНИХ ИНТЕГРАЦИЙ (Open Interfaces)
    // =========================================================================
    namespace OI {
        class BaseApp;                     // Базовый класс интерфейса подключения
        class Telegram;                    // Интеграция с Telegram API
        class GMail;                       // Интеграция с протоколами Google Mail
        class Mail;                        // Интеграция с протоколами Mail.ru
        class VK;                          // Интеграция с ВКонтакте API
        class Word;                        // Обработчик документов .docx
        class Excel;                       // Обработчик таблиц .xlsx
        class PowerPoint;                  // Обработчик презентаций .pptx
        class TextDocument;                // Обработчик сырых текстовых файлов
    }   
}