#pragma once
#include "SwarmIDE.hpp"
#include "ui/canvas/CanvasManager.hpp"

namespace SwarmIDE::UI {

    /**
     * @class AppController
     * @brief Главный управляющий контроллер (оркестратор) жизненного цикла SwarmIDE.
     * @details Этот класс инициализирует графический контекст OpenGL, окно GLFW и интерфейс ImGui. 
     * Он собирает в себе ссылки на все ключевые менеджеры ядра и координирует их совместную работу, 
     * обеспечивая связь между вычислительной логикой (Core) и визуальным слоем (UI/Graphics).
     */
    class AppController {
    public:
        /**
         * @brief Конструктор контроллера приложения.
         * @details Выполняет базовую инициализацию: запускает GLFW, настраивает параметры окна, 
         * инициализирует расширения OpenGL (через GLAD) и связывает менеджеры между собой 
         * (например, прокидывает указатель в `ConnectionManager::SetGraphManager()`).
         */
        AppController();
        
        /**
         * @brief Запуск главного цикла приложения (Main Render Loop).
         * @details Удерживает поток выполнения до закрытия окна. Внутри цикла происходит:
         * - Опрос системных событий ввода (мышь, клавиатура).
         * - Расчет трансформаций камеры #camera и сетки #grid.
         * - Отрисовка интерфейса ImGui и холста графа.
         * - Обновление состояний асинхронных вычислительных потоков.
         */
        void run();

    private:
        GLFWwindow* window;                              /**< Системный указатель на окно программы, управляемое библиотекой GLFW. */
        CanvasManager& canvas_manager;
        
        glm::vec2 lastMousePos = glm::vec2(0.0f);        /**< Координаты последнего зарегистрированного положения курсора мыши (используется для панорамирования). */
        bool isPanning = false;                          /**< Флаг, указывающий, зажата ли кнопка мыши для перемещения (скролла) по холсту. */
    };
}
